{
    "start": {
        "title": "Lobby",
        "text": "You have entered through the glass doors and are now standing in the lobby of the school. It is evident that there haven't been any cleaners here for a while, but the place is not falling apart.\n\nTo your left is a large corkboard with papers and flyers pinned to it. In front of you is a long hallway with lockers on either side.",
        "choices": [
            {
                "text": "Look at the corkboard",
                "nextState": "corkboard"
            },
            {
                "text": "Go forward into the hallway",
                "nextState": "longHallway"
            }
        ]
    },
    "corkboard": {
        "title": "Corkboard",
        "text": "You examine the corkboard and see numerous papers and flyers pinned to it. There are some 'Missing Children' posters and general news articles. There is also a flyer for an autumn prom that looks rather lovely.",
        "choices": [
            {
                "text": "Go back to the lobby",
                "nextState": "start"
            }
        ]
    },
    "longHallway": {
        "title": "Long Hallway",
        "text": "You proceed along a long, straight hallway. On either side of you are lockers, some open yet empty. A series of lamps light up the hallway, although some are broken or flickering. You notice more signs of age and wear, as well as indications of animals having moved in.\n\nYou reach a junction in the hallway. To your left is a door to the nurse's office. To your right is another hallway that leads towards the principal's office. Straight ahead is a shorter hallway that connects to some classrooms.",
        "choices": [
            {
                "text": "Enter the nurse's office on your left",
                "nextState": "nursesOffice"
            },
            {
                "text": "Go straight towards the classrooms",
                "nextState": "hallwayClassrooms"
            },
            {
                "text": "Turn right towards the principal's office",
                "nextState": "hallwayPrincipal"
            },
            {
                "text": "Go back to the lobby",
                "nextState": "start"
            }
        ]
    },
    "hallwayPrincipal": {
        "title": "Hallway towards the principal's office",
        "text": "You walk down the hallway and directly ahead of you is the principal's office. As you walk you pass some classrooms, some tidier than others, but there is nothing of interest within them.\n\nYou reach the door of the office but you cannot see what is behind the door since there is no window. There is no damage that you notice other than wear and tear from age.",
        "choices": [
            {
                "text": "Open the door and enter the office",
                "nextState": "officePrincipal"
            },
            {
                "text": "Go back to the previous hallway",
                "nextState": "longHallway"
            }
        ]
    },
    "officePrincipal": {
        "title": "Principal's office",
        "text": "You enter the office and notice many awards on the walls. Whoever was the last principal was a very smart person. They had multiple doctorates specifically in the medical and technological fields.\n\nYou see a computer on the desk which appears to be powered according to a light that is flashing below the screen. The computer has a post-it note sticking at the edge of the screen.",
        "choices": [
            {
                "text": "Inspect the post-it note",
                "nextState": "inspectSticky"
            },
            {
                "text": "Turn on the computer",
                "nextState": "computerOn",
                "requiresCode": true,
                "codeType": "computer"
            },
            {
                "text": "Go back out into the hallway",
                "nextState": "hallwayPrincipal"
            }
        ]
    },
    "computerOn": {
        "title": "Computer",
        "text": "You were about to give up after two minutes of waiting but just as you were about to leave it turned on! You see an old and basic admin page for the school although most of the data is unavailable since the server isn't connected.\n\n After digging deeper in the files of what you can find and access, you find a note connecting the principal to a tech cult. With that note was also a code '1731'.",
        "choices": [
            {
                "text": "Go back",
                "nextState": "officePrincipal"
            }
        ]
    },
    "inspectSticky": {
        "title": "Post-it note",
        "text": "The post-it says, 'Remember her last.' (12/05/89)",
        "choices": [
            {
                "text": "Go back",
                "nextState": "officePrincipal"
            }
        ]
    },
    "hallwayClassrooms": {
        "title": "Hallway to the classrooms",
        "text": "You walk down the shorter hallway that has two doors on either side that lead into classrooms. Everything in the hallway is just as rundown as the rest of the building. The classrooms are much of the same without anything of interest.",
        "choices": [
            {
                "text": "Go back to the previous hallway",
                "nextState": "longHallway"
            }
        ]
    },
    "nursesOffice": {
        "title": "Nurse's Office",
        "text": "You enter a squeaky clean nurse's office. It looks as if it was cleaned perhaps a few hours ago. Everything is perfectly orderly and organized, despite the fact that no living soul has been here in years.\n\nOn one side, you notice a door with a window where you can see a staircase leading down to a basement of some sort. The door has a combination lock, but you aren't certain where the code could be.",
        "choices": [
            {
                "text": "Descend into the basement",
                "nextState": "basement",
                "requiresCode": true
            },
            {
                "text": "Go back to the hallway",
                "nextState": "longHallway"
            }
        ]
    },
    "basement": {
        "title": "Basement",
        "text": "You descend into an equally spotless basement, towards a light with a wire hanging from it. As you pull on the wire to turn on the light, you hear something move in the darkness ahead. You turn on the light, revealing shelves lining the walls, filled with jars containing brains. There are at least fifty of them.\n\nAt the far end of the basement, you see what made the noise: an abomination. A man cruelly merged with metal, with large blades protruding from various parts of his flesh. Crude clockwork mechanisms are fitted to his joints, and he looks up at you with fear and shame.\n\nHe tries to speak, but you can see scars where his vocal cords once were. With jerky movements, he points to a message scratched into the wall: 'I don't know who I am or how long I have been here. I am in constant pain. If anyone reads this, please put me out of my misery.' He looks at you with pleading eyes, hoping you will fulfill his request.",
        "choices": [
            {
                "text": "Disable the abomination",
                "nextState": "code"
            },
            {
                "text": "Go back to the nurse's office",
                "nextState": "nursesOffice"
            }
        ]
    },
    "code": {
        "title": "Terminal Truth",
        "text": "The shattered man notices your intention, and a sad smile crosses his face. You see him mouth 'Wait' as he scratches another message onto the wall: 'Remember Cerebellum.' Once finished, he nods towards the message and closes his eyes, waiting for you to end his suffering. You walk up behind him and stop the system powering his clockwork heart.",
        "choices": [
            {
                "text": "Leave",
                "action": "redirect"
            }
        ]
    }
}
